{
    "energyml.common2_0.AbstractCitedDataObject": "The Mother Class for all Top Level Elements in RESQML. Inherits from the commonv2 AbstractDataObject. The purpose of this derivation is simply to make the Citation element mandatory. Appropriate to use as a base class in any ML where this is desired.",
    "energyml.common2_0.AbstractObject": "The intended abstract supertype of all schema roots that may be a member of a substitution group (whether contextual or data).  The type of root global elements should be extended from this type and the root global element should be declared to be a member of one of the above substitution groups.",
    "energyml.common2_0.AxisOrder2d": "Defines the cordinate system axis order of the global CRS using the axis names (from EPSG database).",
    "energyml.common2_0.Citation": "An ISO 19115 EIP-derived set of metadata attached to all specializations of AbstractObject to ensure the traceability of each individual independent (top level) element.",
    "energyml.common2_0.CommentString": "The intended abstract supertype of all comments or remarks intended for human consumption. \n\nThere should be no assumption that semantics can be extracted from the field by a computer. \n\nNeither should there be an assumption that any two humans will interpret the information in the same way (i.e., it may not be interoperable).",
    "energyml.common2_0.CustomData": "WITSML - Custom or User Defined Element and Attributes Component Schema.\n                                                Specify custom element, attributes, and types in the custom data area.",
    "energyml.common2_0.DataObjectReference": "It only applies for Energistics data object.",
    "energyml.common2_0.DescriptionString": "A textual description of something.",
    "energyml.common2_0.GmlProjectedCrsDefinition": "This is the Energistics encapsulation of the ProjectedCrs type from GML. ",
    "energyml.common2_0.GmlVerticalCrsDefinition": "This is the Energistics encapsulation of the ProjectedCrs type from GML. ",
    "energyml.common2_0.MaximumLengthString": "This defines the maximum acceptable length of a\n\t\t\tstring that can be stored in a data base.",
    "energyml.common2_0.Measure": "The intended abstract supertype of all quantities that have a value \n                                                with a unit of measure. The unit of measure is in the uom attribute of the subtypes. \n                                                This type allows all quantities to be profiled to be a 'float' instead of a 'double'.",
    "energyml.common2_0.NameString": "The intended abstract supertype of all user assigned human recognizable contextual name types. \n\nThere should be no assumption that (interoperable) semantic information will be extracted from the name by a third party.\n\nThis type of value is generally not guaranteed to be unique and is not a candidate to be replaced by an enumeration.",
    "energyml.common2_0.ProjectedCrs": "This is the Energistics encapsulation of the ProjectedCrs type from GML. ",
    "energyml.common2_0.ProjectedCrsEpsgCode": "This is the Energistics encapsulation of the ProjectedCrs type from GML. ",
    "energyml.common2_0.ProjectedUnknownCrs": "This is the Energistics encapsulation of the ProjectedCrs type from GML. ",
    "energyml.common2_0.String": "The intended abstract supertype of all strings. This abstract type allows the control over whitespace for all strings to be defined at a high level. This type should not be used directly except to derive another type.",
    "energyml.common2_0.TypeEnum": "The intended abstract supertype of all enumerated \"types\". This abstract type allows the maximum length of a type enumeration to be centrally defined. This type should not be used directly except to derive another type. It should also be used for uncontrolled strings which are candidates to become enumerations at a future date.",
    "energyml.common2_0.UidString": "The intended abstract supertype of all locally unique identifiers. \n\t\t\tThe value is not intended to convey any semantic content (e.g., it may be computer generated). \n\t\t\tThe value is only required to be unique within a context in a document (e.g., defined via key and keyref). \n\t\t\tThere is no guarantee that the same data in multiple documents will utilize the same uid value \n\t\t\tunless enforced by the source of the document (e.g., a document server).\n\t\t\tSpaces are not allowed.",
    "energyml.common2_0.UomEnum": "The intended abstract supertype of all \"units of measure\".\n\t\t\tThis abstract type allows the maximum length of a UOM enumeration to be centrally defined. \n\t\t\tThis type is abstract in the sense that it should not be used directly \n\t\t\texcept to derive another type.",
    "energyml.common2_0.VerticalCoordinateUom": "The units of measure that are valid for vertical gravity based coordinates (i.e., elevation or vertical depth).",
    "energyml.common2_0.VerticalCrsEpsgCode": "This is the Energistics encapsulation of the ProjectedCrs type from GML. ",
    "energyml.common2_0.VerticalUnknownCrs": "This is the Energistics encapsulation of the ProjectedCrs type from GML. ",
    "energyml.common2_0.obj_EpcExternalPartReference": "It defines a proxy for external part of the EPC package. It must be used at least for external HDF parts."
}