{
    "energyml.common2_3.AbstractActivityParameter": "General parameter value used in one instance of activity",
    "energyml.common2_3.AbstractBooleanArray": "Generic representation of an array of Boolean values. Each derived element provides a specialized implementation to allow specific optimization of the representation. ",
    "energyml.common2_3.AbstractCartesian2dPosition": "A 2D position given relative to either a projected or local engineering CRS.\n\nThe meanings of the two coordinates and their units of measure are carried in the referenced CRS definition.",
    "energyml.common2_3.AbstractFloatingPointArray": "Generic representation of an array of double values. Each derived element provides specialized implementation to allow specific optimization of the representation.",
    "energyml.common2_3.AbstractIntegerArray": "Generic representation of an array of integer values. Each derived element provides specialized implementation to allow specific optimization of the representation.",
    "energyml.common2_3.AbstractInterval": "Generic representation of a value interval.",
    "energyml.common2_3.AbstractMdGrowingObject": "A growing object where the parts are of type eml:AbstractMdGrowingPart or eml:AbstractMdIntervalGrowingPart.",
    "energyml.common2_3.AbstractMeasure": "The intended abstract supertype of all quantities that have a value with a unit of measure. The unit of measure is in the uom attribute of the subtypes. \n\nThis type allows all quantities to be profiled to be a 'float' instead of a 'double'.",
    "energyml.common2_3.AbstractObject": "The parent class for all top-level elements across the Energistics MLs. ",
    "energyml.common2_3.AbstractParameterKey": "Abstract class describing a key used to identify a parameter value. When multiple values are provided for a given parameter, provides a way to identify the parameter through its association with an object, a time index, etc.  ",
    "energyml.common2_3.AbstractReferencePoint": "A reference point is used as a new origin for some coordinates.\n\nIt is not a CRS. Indeed, it does not redefine axis, uom, etc... it just defines the origin of some axis.",
    "energyml.common2_3.AbstractString": "The intended abstract supertype of all strings. This abstract type allows the control over whitespace for all strings to be defined at a high level. This type should not be used directly except to derive another type.",
    "energyml.common2_3.AbstractTemperaturePressure": "The Abstract base type of standard pressure and temperature",
    "energyml.common2_3.AbstractTimeGrowingObject": "A growing object where the parts are of type eml:AbstractTimeGrowingPart or eml:AbstractTimeIntervalGrowingPart.",
    "energyml.common2_3.AbstractValueArray": "Generic representation of an array of numeric, Boolean, and string values. Each derived element provides specialized implementation for specific content types or for optimization of the representation.",
    "energyml.common2_3.AbstractVerticalDepth": "A vertical (gravity-based) depth coordinate within the context of a well. Positive moving downward from the reference datum. All coordinates with the same datum (and same UOM) can be considered to be in the same coordinate reference system (CRS) and are thus directly comparable.",
    "energyml.common2_3.ActiveStatusKind": "Specifies the active status of the object: active or inactive.",
    "energyml.common2_3.Activity": "Instance of a given activity",
    "energyml.common2_3.ActivityTemplate": "Description of one type of activity.",
    "energyml.common2_3.AddressKindEnum": "Specifies the kinds of company addresses. ",
    "energyml.common2_3.AddressQualifier": "Specifies qualifiers that can be used for addresses or phone numbers. ",
    "energyml.common2_3.Aggregate": "An Energistics data object that is an aggregate of other data objects. Use Case: You want to email someone several different Energistics data objects (which are each separate XML files) from one or more of the Energistics domain standards. You can group those data objects together using Aggregate. \nThis object is NOT INTENDED for use within an ML (e.g. a WITSML) data store, even though it is  constructed similarly to the standard data object pattern. The anticipated normal usage is for collecting an aggregate of object messages for transport outside the context of an ML store.\nThis data object was first developed by WITSML but has been \"promoted\" to Energistics  common for use by any of the Energistics domain standards. ",
    "energyml.common2_3.Attachment": "A dedicated object used to attach digital supplemental data (for example, a graphic or PDF file) to another data object. The attachment is captured as a base 64 binary type.",
    "energyml.common2_3.AxisDirectionKind": "Direction of positive increase in the coordinate value for a coordinate system axis (from ISO 19111)",
    "energyml.common2_3.AxisOrder2d": "Defines the coordinate system axis order of the global CRS using the axis names (from EPSG database).",
    "energyml.common2_3.BooleanArrayFromIndexArray": "An array of Boolean values defined by specifying explicitly which indices in the array are either true or false. This class is used to represent very sparse true or false data.",
    "energyml.common2_3.BooleanConstantArray": "Represents an array of Boolean values where all values are identical. This an optimization for which an array of explicit Boolean values is not required. ",
    "energyml.common2_3.BooleanExternalArray": "Array of Boolean values provided explicitly by an HDF5 dataset.\n\nThis text needs to be altered to say that nulls are not allowed in the underlying implementation",
    "energyml.common2_3.BusinessAssociate": "Describes any company, person, group, consultant, etc., which is associated within a context (e.g., a well). The information contained in this module is: (1) contact information, such as address, phone numbers, email, (2) alternate name, or aliases, and (3) associations, such as the business associate that this one is associated with, or a contact who is associated with this business associate.",
    "energyml.common2_3.Citation": "An ISO 19115 EIP-derived set of metadata attached to all specializations of AbstractObject to ensure the traceability of each individual independent (top level) element.",
    "energyml.common2_3.CollectionKind": "The list of enumerated values for a collection. ",
    "energyml.common2_3.CollectionKindExt": "An Energistics modeling pattern that allows an implementation to extend the defined list of enumerations.\nA writer can use this field to write a string (enumeration) that is not part of the official enumeration.\nA reader must accept this text but is not required to understand or process it. ",
    "energyml.common2_3.CollectionsToDataobjectsAssociationSet": "Allows data objects to be associated in one or more collections.\nBUSINESS RULE : If two or more of the same data object collections are used in one CollectionsToDataobjectsAssociationSet, only one of those data object collections should be taken into account and the other ones must be ignored.",
    "energyml.common2_3.Column": "Defines one column in a column-based table. ",
    "energyml.common2_3.ColumnBasedTable": "A column-based table allows the exchange of tables, where the values are arranged against columns that are defined by PropertyKind, UOM and Facet.\nEXAMPLES: KrPc table and facies tables.",
    "energyml.common2_3.ComponentReference": "A pointer to a component within the same Energistics data object or within a data object pointed to by a separate data object reference.",
    "energyml.common2_3.Cost": "The price of an item, with a currency indication.",
    "energyml.common2_3.CustomData": "WITSML - Custom or User Defined Element and Attributes Component Schema.\n                                                Specify custom element, attributes, and types in the custom data area.",
    "energyml.common2_3.DataAssuranceRecord": "A little XML document describing whether or not a particular data object conforms with a pre-defined policy which consists of at least one rule.",
    "energyml.common2_3.DataIndexKind": "Specifies the kind of value used to index data.",
    "energyml.common2_3.DataObjectComponentReference": "A pointer to a component within another Energistics data object.",
    "energyml.common2_3.DataObjectParameter": "Parameter referencing to a top level object.",
    "energyml.common2_3.DataObjectReference": "A pointer to another Energistics data object.",
    "energyml.common2_3.DataobjectCollection": "Allows multiple data objects to be grouped together into a collection.\nThe relationships (between the data objects and the collection) are specified and managed using the SingleCollectionAssociation.",
    "energyml.common2_3.DensityValue": "A possibly temperature and pressure corrected desity value.",
    "energyml.common2_3.DoubleQuantityParameter": "Parameter containing a double value.",
    "energyml.common2_3.EastOrWest": "Specifies east or west direction.",
    "energyml.common2_3.EmailQualifierStruct": "An email address with an attribute, used to \"qualify\" an email as personal, work, or permanent.",
    "energyml.common2_3.ExistenceKind": "A list of lifecycle states like actual, required, planned, predicted, etc. These are used to qualify any top-level element (from Epicentre 2.1).",
    "energyml.common2_3.ExistenceKindExt": "An Energistics modeling pattern  that allows an implementation to extend the ExistenceKind enumeration. \nA writer can use this field to write a string (enumeration) that is not part of the official enumeration. \nA reader must accept this text but is not required to understand or process it. ",
    "energyml.common2_3.ExtensionNameValue": "Extension values Schema. The intent is to allow standard ML domain \"named\" extensions without having to modify the schema. A client or server can ignore any name that it does not recognize but certain metadata is required to allow generic clients or servers to process the value.",
    "energyml.common2_3.ExternalDataArray": "A concatenation of ExternalDataArrayParts, which are pointers to a whole or to a sub-selection of an existing array that is in a different file (than the Energistics data object). It generally and historically points to an HDF5 dataset in an Energistics Packaging Conventions (EPC) context. \nIt is common to have only 1 ExternalDataArrayPart in an ExternalDataArray. ",
    "energyml.common2_3.ExternalDataArrayPart": "Pointers to a whole or to a sub-selection of an existing array that is in a different file than the Energistics data object. ",
    "energyml.common2_3.FacetExt": "The extensible enumeration of facets.",
    "energyml.common2_3.FacetKind": "Enumerations of the type of qualifier that applies to a property type to provide additional context about the nature of the property. For example, may include conditions, direction, qualifiers, or statistics. Facets are used in RESQML to provide qualifiers to existing property types, which minimizes the need to create specialized property types.",
    "energyml.common2_3.FacilityLifecyclePeriod": "This class is used to represent a period of time when a facility was in a lifecycle state.",
    "energyml.common2_3.FacilityLifecycleStateExt": "The extensible enumeration of facility life cycle states.",
    "energyml.common2_3.FacilityOperator": "This class is used to represent the BusinessAssociate that operates or operated a facility and, optionally, the time interval during which the business associated is or was the operator.",
    "energyml.common2_3.FailingRule": "The FailingRule class holds summary information on which of the rules within a policy failed.",
    "energyml.common2_3.FloatingPointConstantArray": "Represents an array of double values where all values are identical. This an optimization for which an array of explicit double values is not required.",
    "energyml.common2_3.FloatingPointExternalArray": "An array of double values provided explicitly by an HDF5 dataset.\nBy convention, the null value is NaN.",
    "energyml.common2_3.FloatingPointLatticeArray": "Represents an array of doubles based on an origin and a multi-dimensional offset. The offset is based on a linearization of a multi-dimensional offset.\n\nIf count(i) is the number of elements in the dimension i and offset(i) is the offset in the dimension i, then:\nglobalOffsetInNDimension = startValue+ ni*offset(n) + n_1i*count(n)*offset(n-1) + .... + 0i*count(n)*count(n-1)*....count(1)*offset(0)",
    "energyml.common2_3.FlowRateValue": "A possibly temperature and pressure corrected flow rate value.",
    "energyml.common2_3.GeneralAddress": "An general address structure. This form is appropriate for most countries.",
    "energyml.common2_3.GenericMeasure": "A generic measure type.\nThis should not be used except in situations where the underlying class of data is \ncaptured elsewhere. For example, for a log curve.",
    "energyml.common2_3.GeochronologicalRank": "Qualifier for the geological time denoted by the GeochronologicalUnit: eon, era, epoch, etc.",
    "energyml.common2_3.GeodeticEpsgCrs": "This class contains the EPSG code for a geodetic CRS. ",
    "energyml.common2_3.GeodeticLocalAuthorityCrs": "This class contains a code for a geodetic CRS according to a local authority. This would be used in a case where a company or regulatory regime has chosen not to use EPSG codes.",
    "energyml.common2_3.GeodeticUnknownCrs": "This class is used in a case where the coordinate reference system is either unknown or is intentionally not being transferred.",
    "energyml.common2_3.GeodeticWktCrs": "ISO 19162-compliant well-known text for the Geodetic CRS.",
    "energyml.common2_3.GeographicCoordinates": "Coordinates in a geodetic coordinate reference system. \n\nCoordinate 1 is a latitude\nCoordinate 2 is a longitude",
    "energyml.common2_3.GeologicTime": "This class is used to represent a time at several scales: \n\t- A mandatory and precise DateTime used to characterize a TimeStep in a TimeSeries\n\t- An optional Age Offset (corresponding to a geological event occurrence) in  years. This age offset must be positive when it represents a GeologicalEvent occurrence in the past. This Age Offset is not required to be positive, to allow for the case of simulating future geological events.  \n\nWhen geological time is used to represent a geological event occurrence, the DateTime must be set by the software writer at a date no earlier than 01/01/1950. Any DateTime (even the creation DateTime of the instance) can be set in this attribute field.",
    "energyml.common2_3.GrowingObjectIndex": "Common information about the index for a growing object.\n\nIMMUTABLE. Set on object creation and MUST NOT change thereafter. Customer provided changes after creation are an error. None of the sub-elements can be changed.",
    "energyml.common2_3.IndexDirection": "Specifies the direction of the index, whether decreasing, increasing or unordered. For secondary indexes, the direction depends on the direction of the primary index. Unordered is only for secondary indexes.",
    "energyml.common2_3.IndexRange": "In the case that the ReferencedData is indexed and the conformance with the DataAssurance policy applies to a range within that index space, this class represents that range.\n\nThe elements are string types because the index could be of numerous data types, including integer, float and date.",
    "energyml.common2_3.IndexableElement": "Indexable elements for the different representations. The indexing of each element depends upon the specific representation.\nTo order and reference the elements of a representation, RESQML makes extensive use of the concept of indexing. Both one-dimensional and multi-dimensional arrays of elements are used. So that all elements may be referenced in a consistent and uniform fashion, each multi-dimensional index must have a well-defined 1D index.\n\nAttributes below identify the IndexableElements, though not all elements apply to all types of representations. \n\nIndexable elements are used to:\n\t- attach geometry and properties to a representation.\n\t- identify portions of a representation when expressing a representation identity.\n\t- construct a sub-representation from an existing representation.\n\nFor the table of indexable elements and the representations to which they apply, see the RESQML Technical Usage Guide.",
    "energyml.common2_3.IntegerArrayFromBooleanMaskArray": "One-dimensional array of integer values obtained from the true elements of the Boolean mask.",
    "energyml.common2_3.IntegerConstantArray": "Represents an array of integer values where all values are identical. This an optimization for which an array of explicit integer values is not required.",
    "energyml.common2_3.IntegerExternalArray": "Array of integer values provided explicitly by an HDF5 dataset. The null value must be  explicitly provided in the NullValue attribute of this class.",
    "energyml.common2_3.IntegerLatticeArray": "Represents an array of integers based on an origin and a multi-dimensional offset. The offset is based on a linearization of a multi-dimensional offset.\n\nIf count(i) is the number of elements in the dimension i and offset(i) is the offset in the dimension i, then:\nglobalOffsetInNDimension = startValue+ ni*offset(n) + n_1i*count(n)*offset(n-1) + .... + 0i*count(n)*count(n-1)*....count(1)*offset(0)",
    "energyml.common2_3.IntegerQuantityParameter": "Parameter containing an integer value.",
    "energyml.common2_3.JaggedArray": "Data storage object for an array of variable length 1D sub-arrays. The jagged array object consists of these two arrays: \n\t- An aggregation of all the variable length sub-arrays into a single 1D array.   \n\t- The offsets into the single 1D array, given by the sum of all the sub-array lengths up to and including the current sub-array.  \nOften referred to as a \"list-of-lists\" or \"array-of-arrays\" construction.\n\nFor example to store the following three arrays as a jagged array:\n(a b c)\n(d e f g)\n(h)\nElements = (a b c d e f g h)\nCumulative Length = (3 7 8)",
    "energyml.common2_3.LengthAndTimeUomExt": "This is a union of the units of measure for both length and time, plus the extensibility pattern.\n\nUse of this will allow an attribute to validate on either time or depth (or lateral distance) units.",
    "energyml.common2_3.LithologyKind": "A description of minerals or accessories that constitute a fractional part of a lithology description",
    "energyml.common2_3.LithostratigraphicRank": "Specifies the unit of lithostratigraphy.",
    "energyml.common2_3.LocalEngineeringCompoundCrs": "A local Engineering compound CRS is based on a LocalEngineering2dCRS + a vertical CRS. ",
    "energyml.common2_3.MatrixCementKind": "Lithology matrix/cement description. The list of standard values is contained in the WITSML enumValues.xml file.",
    "energyml.common2_3.MeasureClass": "Measure class values. The list of standard values is contained in the WITSML enumValues.xml file.",
    "energyml.common2_3.MeasuredDepth": "A measured depth coordinate in a wellbore. Positive moving from the reference datum toward the bottomhole. All coordinates with the same datum (and same UOM) can be considered to be in the same coordinate reference system (CRS) and are thus directly comparable.",
    "energyml.common2_3.NameStruct": "The name of something within a naming system.",
    "energyml.common2_3.NestedColumnBasedTable": "Allows a table to be contained in an abstract object (AbstractObject) without carrying all of the information of an abstract object (such as UUID, schema version, object version, aliases, extensions, etc.)\nAlso, it is not a data object, meaning it is not discoverable by itself in an ETP context.",
    "energyml.common2_3.NorthOrSouth": "Specifies the north or south direction.",
    "energyml.common2_3.NorthReferenceKind": "The kinds of north references likely to be encountered in oil & gas data. A north reference is a clear definition of what is meant by the word \"north\" (and by extension all of the compass points). Some of this wording is from the NGS Geodetic Glossary.\n\ntrue north - the common name of what is formally called geodetic north. This is along the rotational axis of the earth, and cannot be easily measured in the field.  The rigorous definition of geodetic north is \"the positive direction of that line parallel to the Earth's axis of rotation and perpendicularly to the left of an observer facing in the direction of the Earth's rotation.\" True north is normally computed from an imperfect measurement of north.\n\nastronomic north - An estimate of true north derived from astronomic observations. This differs from true north slightly because astronomic instruments rely on gravity to define \"up\" (the vertical) while the earth's gravity field is seldom perfectly vertical. A \"Laplace correction\" is applied to the astronomic north to get geodetic north. Astronomic north is seldom used in oil & gas operations.\n\nmagnetic north - The direction of the Earth's magnetic north pole. A \"declination\" correction is applied to calculate true north from magnetic north. Since the Earth's magnetic north pole is constantly in motion, the date and time an observation is made are critically important to be able to find the correct declination value to be used.\n\ncompass north - A raw reading of the north-seeking end of a needle or other magnetic component of a compass. This differs from magnetic north because of the influence of iron and other magnetic materials which disturb the Earth's magnetic field close to the compass instrument. There may be a correction applied to compass north to realize a magnetic north reading. This kind of north is encountered in older oil & gas data.\n\ngrid north - The direction of the north lines on a map projection. In most projections there is only one north line which points to true geodetic north, the central meridian in a UTM projection, for example. At any point on a grid there can be a \"convergence angle\" defined which relates the grid north to true geodetic north. Grid north is not measured in the field; it must be calculated.\n\nplant north - A direction in a local engineering coordinate reference system which is normally oriented more or less north. This is used in industrial facilities (like gas plants or offshore platforms) and for smaller areas like drilling pads. Distances and directions in this local system are easier to handle without need for a professional land surveyor because the need for accuracy is less and the distances involved are limited. In this case a surveyor might determine the location of a corner of the facility and the angle between true north and the apparent north of the facility.",
    "energyml.common2_3.OSDUIntegration": "Container for elemnts and types needed solely for intagration within OSDU.",
    "energyml.common2_3.OSDULineageAssertion": "Defines relationships with other objects (any kind of Resource) upon which this work product component depends.  The assertion is directed only from the asserting WPC to ancestor objects, not children.  It should not be used to refer to files or artefacts within the WPC -- the association within the WPC is sufficient and Artefacts are actually children of the main WPC file.",
    "energyml.common2_3.OSDUReferencePointIntegration": "OSDU-specific details about reference point.",
    "energyml.common2_3.OSDUSpatialLocationIntegration": "Details about an OSDU Spatial Location.",
    "energyml.common2_3.ObjectAlias": "Use this to create multiple aliases for any object instance. Note that an Authority is required for each alias.",
    "energyml.common2_3.OrganizationKind": "Kind of organization.",
    "energyml.common2_3.ParameterTemplate": "Description of one parameter that participate in one type of activity.",
    "energyml.common2_3.PersonName": "The components of a person's name.",
    "energyml.common2_3.PhoneNumberStruct": "A phone number with two attributes, used to \"type\" and \"qualify\" a phone number. The type would carry information such as fax, modem, voice, and the qualifier would carry information such as home or office.",
    "energyml.common2_3.PhoneType": "Specifies the types phone number (e.g., fax, mobile, etc.)",
    "energyml.common2_3.PressurePerFlowrateMeasure": "PressurePerFlowrateSquared, P/Q^2 is the unit for turbulent flow pressure drop in the layer inflow relationship.",
    "energyml.common2_3.PressurePerFlowrateSquaredMeasure": "PressurePerFlowrateSquared, P/Q^2 is the unit for turbulent flow pressure drop in the layer inflow relationship.",
    "energyml.common2_3.PrincipalMeridian": "Specifies values for the principal meridians for the United States Public Land Surveys.",
    "energyml.common2_3.ProjectedEpsgCrs": "This class contains the EPSG code for a projected CRS.",
    "energyml.common2_3.ProjectedLocalAuthorityCrs": "This class contains a code for a projected CRS according to a local authority. This would be used in a case where a company or regulatory regime has chosen not to use EPSG codes.",
    "energyml.common2_3.ProjectedUnknownCrs": "This class is used in a case where the coordinate reference system is either unknown or is intentionally not being transferred. In this case, the uom and AxisOrder need to be provided on the ProjectedCrs class.",
    "energyml.common2_3.ProjectedWktCrs": "ISO 19162-compliant well-known text for the projected CRS",
    "energyml.common2_3.PropertyKind": "Property kinds carry the semantics of property values. They are used to identify if the values are, for example, representing porosity, length, stress tensor, etc. Energistics provides a list of standard property kind that represent the basis for the commonly used properties in the E&P subsurface workflow.",
    "energyml.common2_3.PropertyKindDictionary": "This dictionary defines property kind which is intended to handle the requirements of the upstream oil and gas industry. ",
    "energyml.common2_3.PropertyKindFacet": "Qualifiers for property values, which allow users to semantically specialize a property without creating a new property kind.\nFor the list of enumerations, see FacetKind. ",
    "energyml.common2_3.PublicLandSurveySystemCoordinates": "Coordinates given in the US Public Land Survey System (Jeffersonian surveying). The parameters in the PublicLandSurveySystem element form a local engineering coordinate reference system with coordinate1 and coordinate2 being the distances in feet from the edge lines of the defined section fraction.\n\nThe order and direction of the coordinates are given in the AxisOrder element, which is validated via the AxisOrder2d enumeration.",
    "energyml.common2_3.PublicLandSurveySystemLocation": "Land survey system that describes the well by range, township, section, etc.",
    "energyml.common2_3.PublicLandSurveySystemQuarterSection": "Some combination of NE, NW, SW, SE, N2, S2, E2, W2, C, TRxx, LTnn. USA Public Land Survey System.",
    "energyml.common2_3.PublicLandSurveySystemQuarterTownship": "Designates a particular quarter of a township (Ohio only). USA Public Land Survey System.",
    "energyml.common2_3.RecursiveReferencePoint": "A reference point defined in the context of another reference point.",
    "energyml.common2_3.ReferenceCondition": "Combinations of standard temperature and pressure including \"ambient\". The list of standard values is contained in the enumValuesProdml.xml file.",
    "energyml.common2_3.ReferencePointInACrs": "A reference point which is defined in the context of a compound (2d horizontal + 1D vertical) CRS.",
    "energyml.common2_3.ReferencePointInALocalEngineeringCompoundCrs": "A reference point which is defined in the context of a compound (2D horizontal + 1D vertical) CRS.\nNote that a 2D compound CRS can be transferred  by omitting the vertical Coordinate3",
    "energyml.common2_3.ReferencePointInAWellbore": "A reference point which is defined in the context of a wellbore by means of a MD.\n\nIf TVD is needed, it must be given through the inherited vertical Coordinate.",
    "energyml.common2_3.ReferencePointKind": "This enumeration holds the normal wellbore datum references plus Well head and well surface location, the two common reference points not along a wellbore.",
    "energyml.common2_3.ReferencePressureKind": "ReferencePressureKind",
    "energyml.common2_3.ReferenceTemperaturePressure": "StdTempPress",
    "energyml.common2_3.SectionNumber": "Sections are numbered \"1\" through \"36.\" Irregular sections may be designated with a single value after a decimal point. USA Public Land Survey System.",
    "energyml.common2_3.SingleCollectionAssociation": "Indicates the data objects that are associated to a single collection.\nBUSINESS RULE: The same collection CANNOT be used in multiple SingleCollectionAssociations of the same CollectionsToDataobjectsAssociations. \nBUSINESS RULE : If two or more of the same data objects are used in one SingleCollectionAssociation, only one data object should be taken into account and the other ones must be ignored.",
    "energyml.common2_3.StringConstantArray": "Represents an array of Boolean values where all values are identical. This an optimization for which an array of explicit Boolean values is not required. ",
    "energyml.common2_3.StringExternalArray": "Used to store explicit string values, i.e., values that are not double, boolean or integers. The datatype of the values will be identified by means of the HDF5 API.",
    "energyml.common2_3.StringParameter": "Parameter containing a string value.",
    "energyml.common2_3.TemperaturePressure": "temperature and pressure",
    "energyml.common2_3.TimeIndex": "Index into a time series. Used to specify time. (Not to be confused with time step.)",
    "energyml.common2_3.TimeIndexParameter": "Parameter containing a time index value.",
    "energyml.common2_3.TimeSeries": "Stores an ordered list of times, for example, for time-dependent properties, geometries, or representations. It is used in conjunction with the time index to specify times for RESQML.\n\nBusiness Rule: If present TimeStep count must match Time count",
    "energyml.common2_3.TimeSeriesParentage": "Indicates that a time series has the associated time series as a parent, i.e., that the series continues from the parent time series.",
    "energyml.common2_3.TimeZone": "A time zone conforming to the XSD:dateTime specification.",
    "energyml.common2_3.TypeEnum": "The intended abstract supertype of all enumerated \"types\". This abstract type allows the maximum length of a type enumeration to be centrally defined. This type should not be used directly except to derive another type. It should also be used for uncontrolled strings which are candidates to become enumerations at a future date.",
    "energyml.common2_3.UnitOfMeasure": "This is a list of the valid units of measure across all the measure classes. Its intended use is to ensure that a valid unit of measure string is used in cases where the measure class is not known in advance or is otherwise not explicitly modeled in the XML schema.",
    "energyml.common2_3.UnitOfMeasureExt": "A variant of UnitOfMeasure which has been extended to allow any user-defined unit of measure which follows an authority:unit pattern; the colon is mandatory.\n\nThis class is implemented in XML as a union between the list of valid units per the prevailing Energistics Units of Measure Specification and an XML pattern which mandates the central colon.",
    "energyml.common2_3.UnitlessMeasure": "A unitless measure is a measure which has no unit of measure symbol, but could be a real physical measurement. Examples would be pH, wire gauge (AWG and BWG) and shoe size.\n\nThis is different from a dimensionless measure which represents a ratio whose units of measure have cancelled each other. DImensionless measures can have units of measure (like ppm or %) or may not have a displayable unit of measure symbol (in which case the units symbol Euc is used in a data transfer).",
    "energyml.common2_3.UomEnum": "The intended supertype of all \"units of measure\".\nThis abstract type allows the maximum length of a UOM enumeration to be centrally defined. \nThis type is abstract in the sense that it should not be used directly except to derive another type.",
    "energyml.common2_3.VerticalCoordinateUom": "The units of measure that are valid for vertical gravity based coordinates (i.e., elevation or vertical depth).",
    "energyml.common2_3.VerticalEpsgCrs": "This class contains the EPSG code for a vertical CRS.",
    "energyml.common2_3.VerticalLocalAuthorityCrs": "This class contains a code for a vertical CRS according to a local authority. This would be used in a case where a company or regulatory regime has chosen not to use EPSG codes. ",
    "energyml.common2_3.VerticalUnknownCrs": "This class is used in a case where the coordinate reference system is either unknown or is intentionally not being transferred. In this case, the uom and Direction need to be provided on the VerticalCrs class.",
    "energyml.common2_3.VerticalWktCrs": "ISO 19162-compliant well-known text for the vertical CRS",
    "energyml.common2_3.VolumeValue": "A possibly temperature and pressure corrected volume value.",
    "energyml.common2_3.WellStatus": "These values represent the status of a well or wellbore.",
    "energyml.common2_3.WellStatusPeriod": "This class is used to represent a period of time when a facility had a consistent WellStatus."
}